import React from 'react'
import './index.css'

function Text() {
  const [open, setOpen] = React.useState(false)

  const handleOpenButton = () => {
    setOpen(!open)
  }

  return (
    <div className="description">
      <p>
        Лікар-онколог - це фахівець, який спеціалізується на діагностиці та лікуванні онкологічних захворювань. Якщо у
        вас виникла підозра на рак, то важливо швидко знайти кваліфікованого лікаря-онколога для проведення діагностики
        та призначення лікування.
      </p>
      {open && (
        <p>
          На нашому сайті ви зможете знайти список лікарів-онкологів з відповідним досвідом та кваліфікацією. Ми
          співпрацюємо з провідними клініками та медичними центрами, що забезпечують високоякісне лікування онкологічних
          захворювань. Для того, щоб знайти лікаря-онколога на нашому сайті, вам необхідно заповнити коротку форму з
          інформацією про місце проживання та тип онкології. Наш алгоритм швидко підбере для вас список кваліфікованих
          лікарів-онкологів з вашого регіону. Крім того, наш сайт надає детальну інформацію про кожного лікаря-онколога,
          що дозволяє зробити вибір на основі відгуків пацієнтів, рейтингу, досвіду роботи та освіти. <br /> Ми
          розуміємо, наскільки важливо швидко знайти кваліфікованого лікаря-онколога у випадку підозри на рак. Наш сайт
          допоможе вам швидко та легко знайти кращого фахівця для діагностики та лікування онкологічного захворювання.
        </p>
      )}
      <button onClick={handleOpenButton}>{open ? 'сховати' : 'детальніше'}</button>
    </div>
  )
}
export default Text
